
## Plan Result




<pre><code>Plan: 2 to add, 13 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY
  * module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.div-aos-overdue-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-bulk-print-config-errors-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-bulkcase-errors-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-data-extraction-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-fe-performance-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-server-errors-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-vault.azurerm_key_vault.kv
  * module.div-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.div-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.divorce-action-group.azurerm_template_deployment.action-group
  * module.divorce-action-group2.azurerm_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.div_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "div_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "div-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "div-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Insights/components/div-aat"
        name                                  = "div-aat"
      ~ tags                                  = {
          - "Deployment Environment" = "aat" -> null
          - "Destroy Me"             = "No" -> null
          - "Team Contact"           = "#div-dev" -> null
          - "Team Name"              = "Divorce" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY will be created
  + resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"
      + name                    = "AppInsightsInstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat"
        name     = "div-aat"
      ~ tags     = {
          - "Deployment Environment" = "aat" -> null
          - "Destroy Me"             = "No" -> null
          - "Team Name"              = "Divorce" -> null
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.div-aos-overdue-alert.azurerm_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-aos-overdue-alert"
        name                = "div-aos-overdue-alert"
      ~ parameters          = {
          + "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
            # (13 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + commonTags               = {
                      + type = "string"
                    }
                    # (13 unchanged elements hidden)
                }
              ~ resources      = [
                  ~ {
                        name       = "[parameters('alertName')]"
                      ~ tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        } -> "[union(variables('tags'), variables('additionalTags'))]"
                        # (4 unchanged elements hidden)
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
                # (2 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-bulk-print-config-errors-alert.azurerm_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-bulk-print-config-errors-alert"
        name                = "div-bulk-print-config-errors-alert"
      ~ parameters          = {
          + "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
            # (13 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + commonTags               = {
                      + type = "string"
                    }
                    # (13 unchanged elements hidden)
                }
              ~ resources      = [
                  ~ {
                        name       = "[parameters('alertName')]"
                      ~ tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        } -> "[union(variables('tags'), variables('additionalTags'))]"
                        # (4 unchanged elements hidden)
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
                # (2 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-bulkcase-errors-alert.azurerm_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-bulkcase-errors"
        name                = "div-bulkcase-errors"
      ~ parameters          = {
          + "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
            # (13 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + commonTags               = {
                      + type = "string"
                    }
                    # (13 unchanged elements hidden)
                }
              ~ resources      = [
                  ~ {
                        name       = "[parameters('alertName')]"
                      ~ tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        } -> "[union(variables('tags'), variables('additionalTags'))]"
                        # (4 unchanged elements hidden)
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
                # (2 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-data-extraction-alert.azurerm_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-data-extraction-alert"
        name                = "div-data-extraction-alert"
      ~ parameters          = {
          + "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
            # (13 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + commonTags               = {
                      + type = "string"
                    }
                    # (13 unchanged elements hidden)
                }
              ~ resources      = [
                  ~ {
                        name       = "[parameters('alertName')]"
                      ~ tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        } -> "[union(variables('tags'), variables('additionalTags'))]"
                        # (4 unchanged elements hidden)
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
                # (2 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-fe-performance-alert.azurerm_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-fe-performance-alert"
        name                = "div-fe-performance-alert"
      ~ parameters          = {
          + "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
            # (13 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + commonTags               = {
                      + type = "string"
                    }
                    # (13 unchanged elements hidden)
                }
              ~ resources      = [
                  ~ {
                        name       = "[parameters('alertName')]"
                      ~ tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        } -> "[union(variables('tags'), variables('additionalTags'))]"
                        # (4 unchanged elements hidden)
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
                # (2 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-server-errors-alert.azurerm_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-server-errors"
        name                = "div-server-errors"
      ~ parameters          = {
          + "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
            # (13 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + commonTags               = {
                      + type = "string"
                    }
                    # (13 unchanged elements hidden)
                }
              ~ resources      = [
                  ~ {
                        name       = "[parameters('alertName')]"
                      ~ tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        } -> "[union(variables('tags'), variables('additionalTags'))]"
                        # (4 unchanged elements hidden)
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
                # (2 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"
        name                            = "div-aat"
      ~ purge_protection_enabled        = false -> true
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.div-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (7 unchanged elements hidden)
            "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/objectId/f2ef9d16-488a-4b84-b433-3eb4225923cb"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "div-aat"
      + target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

  # module.divorce-action-group.azurerm_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support_aat"
        name                = "div-support_aat"
      ~ parameters          = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "emailReceiverAddress" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.divorce-action-group2.azurerm_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support2_aat"
        name                = "div-support2_aat"
      ~ parameters          = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "emailReceiverAddress" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 13 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":78,"Program":"tfcmt","SHA1":"","Vars":{}} -->